In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import re
from tqdm import tqdm

In [196]:
df = pd.read_excel('./rain.xlsx')
df.head(100)

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time
0,ID_6321,"FTI College, Law College Road, Pune","Fast Food, Rolls, Burger, Salad, Wraps",₹200,₹50,3.5,12,4,30 minutes
1,ID_2882,"Sector 3, Marathalli","Ice Cream, Desserts",₹100,₹50,3.5,11,4,30 minutes
2,ID_1595,Mumbai Central,"Italian, Street Food, Fast Food",₹150,₹50,3.6,99,30,65 minutes
3,ID_5929,"Sector 1, Noida","Mughlai, North Indian, Chinese",₹250,₹99,3.7,176,95,30 minutes
4,ID_6123,"Rmz Centennial, I Gate, Whitefield","Cafe, Beverages",₹200,₹99,3.2,521,235,65 minutes
...,...,...,...,...,...,...,...,...,...
95,ID_3468,"D-Block, Sector 63, Noida",Fast Food,₹100,₹50,3.3,13,4,30 minutes
96,ID_3797,"Delhi High Court, India Gate",Fast Food,₹200,₹50,3.3,25,16,30 minutes
97,ID_6224,"D-Block, Sector 63, Noida",Chinese,₹100,₹50,3.5,24,1,30 minutes
98,ID_1124,Delhi University-GTB Nagar,"Burger, Fast Food",₹100,₹50,-,-,-,30 minutes
99,ID_6637,Delhi Cantt.,Mughlai,₹150,₹50,2.8,7,3,30 minutes

In [10]:
df.isnull().sum()

Restaurant       0
Location         0
Cuisines         0
Average_Cost     0
Minimum_Order    0
Rating           0
Votes            0
Reviews          0
Delivery_Time    0
dtype: int64

In [7]:
df.Location.unique()

array(['FTI College, Law College Road, Pune', 'Sector 3, Marathalli',
       'Mumbai Central', 'Sector 1, Noida',
       'Rmz Centennial, I Gate, Whitefield', 'Delhi University-GTB Nagar',
       'Yerawada, Pune, Maharashtra',
       'Delhi Administration Flats, Timarpur', 'Moulali, Kolkata',
       'Dockyard Road, Mumbai CST Area', 'Pune University',
       'Gora Bazar, Rajbari, North Dumdum, Kolkata',
       'D-Block, Sector 63, Noida', 'Sector 14, Noida',
       'Mico Layout, Stage 2, BTM Layout,Bangalore',
       'Laxman Vihar Industrial Area, Sector 3A, Gurgoan',
       'Tiretti, Kolkata', 'Sandhurst Road, Mumbai CST Area',
       'MG Road, Pune', 'Hyderabad Public School, Begumpet', 'Majestic',
       'Chandni Chowk, Kolkata', 'Delhi High Court, India Gate',
       'Chatta Bazaar, Malakpet, Hyderabad', 'Sector 63A,Gurgaon',
       'Delhi Cantt.', 'Tejas Nagar Colony, Wadala West, Mumbai',
       'Babarpur, New Delhi, Delhi', 'Nathan Road, Mangaldas Road, Pune',
       'Panjetan Colony, Malakpet, Hyderabad', 'Raja Bazar, Kolkata',
       'Jaya Nagar, Saidabad, Hyderabad',
       'Noorkhan Bazaar, Malakpet, Hyderabad',
       'Musi Nagar, Malakpet, Hyderabad', 'BTM Layout 1, Electronic City'],
      dtype=object)

In [11]:
df.describe(include = 'all')

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time
count,11094,11094,11094,11094,11094,11094,11094,11094,11094
unique,7480,35,2179,26,18,33,1103,761,7
top,ID_7184,"Mico Layout, Stage 2, BTM Layout,Bangalore",North Indian,₹200,₹50,-,-,-,30 minutes
freq,22,947,850,3241,10118,1191,2074,2312,7406

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11094 entries, 0 to 11093
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Restaurant     11094 non-null  object
 1   Location       11094 non-null  object
 2   Cuisines       11094 non-null  object
 3   Average_Cost   11094 non-null  object
 4   Minimum_Order  11094 non-null  object
 5   Rating         11094 non-null  object
 6   Votes          11094 non-null  object
 7   Reviews        11094 non-null  object
 8   Delivery_Time  11094 non-null  object
dtypes: object(9)
memory usage: 780.2+ KB

In [15]:
df['Average_Cost'].unique()

array(['₹200', '₹100', '₹150', '₹250', '₹650', '₹350', '₹800', '₹50',
       '₹400', '₹600', '₹300', '₹750', '₹450', '₹550', '₹1,000', '₹500',
       '₹900', '₹1,200', '₹950', '₹850', '₹700', '₹1,150', 'for',
       '₹1,100', '₹1,400', '₹2,050'], dtype=object)

In [156]:
df[df['Average_Cost'] == 'for']

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time
6297,ID_6472,Pune University,Fast Food,for,₹50,NEW,-,-,30 minutes

In [197]:
df['Average_Cost'].replace('for', '200', inplace = True)

In [198]:
df['Average_Cost_Cleaned'] = df['Average_Cost'].apply(lambda x: int(re.sub("[^0-9]", "", x)))

In [199]:
df['Average_Cost_Cleaned'].unique()

array([ 200,  100,  150,  250,  650,  350,  800,   50,  400,  600,  300,
        750,  450,  550, 1000,  500,  900, 1200,  950,  850,  700, 1150,
       1100, 1400, 2050], dtype=int64)

In [200]:
df['Minimum_Order'].unique()

array(['₹50', '₹99', '₹0', '₹200', '₹450', '₹350', '₹79', '₹400', '₹199',
       '₹500', '₹250', '₹150', '₹90', '₹299', '₹300', '₹240', '₹89',
       '₹59'], dtype=object)

In [201]:
df['Minimum_Order_Cleaned'] = df['Minimum_Order'].apply(lambda x: int(re.sub("[^0-9]", "", x)))

In [26]:
df.head()

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time,Average_Cost_Cleaned,Minimum_Order_Cleaned
0,ID_6321,"FTI College, Law College Road, Pune","Fast Food, Rolls, Burger, Salad, Wraps",₹200,₹50,3.5,12,4,30 minutes,200,50
1,ID_2882,"Sector 3, Marathalli","Ice Cream, Desserts",₹100,₹50,3.5,11,4,30 minutes,100,50
2,ID_1595,Mumbai Central,"Italian, Street Food, Fast Food",₹150,₹50,3.6,99,30,65 minutes,150,50
3,ID_5929,"Sector 1, Noida","Mughlai, North Indian, Chinese",₹250,₹99,3.7,176,95,30 minutes,250,99
4,ID_6123,"Rmz Centennial, I Gate, Whitefield","Cafe, Beverages",₹200,₹99,3.2,521,235,65 minutes,200,99

In [129]:
df.describe(include = 'all')

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time,Average_Cost_Cleaned,Minimum_Order_Cleaned
count,11094,11094,11094,11094,11094,11094,11094,11094,11094,11094.000000,11094.000000
unique,7480,35,2179,26,18,33,1103,761,7,NaN,NaN
top,ID_7184,"Mico Layout, Stage 2, BTM Layout,Bangalore",North Indian,₹200,₹50,-,-,-,30 minutes,NaN,NaN
freq,22,947,850,3241,10118,1191,2074,2312,7406,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,202.708671,53.344511
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,129.833261,18.551245
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,50.000000,0.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,100.000000,50.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,200.000000,50.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,200.000000,50.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2050.000000,500.000000

In [160]:
def non_numerals(series):
  non_numerals = []
  for i in series.unique():
    try :
      i = float(i)
    except:
      non_numerals.append(i)
  return non_numerals

In [161]:
def replace_nn_with(series, type_, fill_with = None, method = 'mean'):

  nn = non_numerals(series)
  print('-'*30)
  print('-'*30)
  print("Non Numerals in column ",series.name," : ",nn)

  series = series.replace(nn, np.nan, inplace = False)
  nulls = series.isnull().sum()
  if fill_with:
    series.fillna(fill_with, inplace = True)
    print("Filling Non Numerals with {}".format(fill_with))
  
  else:
    series = series.replace(nn, np.nan, inplace = False)

    if method == 'mean' :
      rep = series.astype(float).mean()
      print("Filling Non Numerals with MEAN = ", rep)

    elif method == 'median' :
      rep = series.astype(float).median()
      print("Filling Non Numerals with MEDIAN = ", rep)

    elif method == 'min' :
      rep = series.astype(float).min()
      print("Filling Non Numerals with MINIMUM = ", rep)

    else:
      print('Please pass a valid method as a string -- ("mean" or "median" or "min")')
      return 0

    series.fillna(rep, inplace = True)
    
  try:
    series = series.astype(type_)
    print(nulls, ": observations replaced")
    return series
  except:
    # Since type conversion of a string containting decimals to int is not possible, it is first converted to float
    series =  series.astype(float)
    print(nulls, ": observations replaced")
    series =  series.astype(type_)
    return series

In [33]:
df.head()

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time,Average_Cost_Cleaned,Minimum_Order_Cleaned
0,ID_6321,"FTI College, Law College Road, Pune","Fast Food, Rolls, Burger, Salad, Wraps",₹200,₹50,3.5,12,4,30 minutes,200,50
1,ID_2882,"Sector 3, Marathalli","Ice Cream, Desserts",₹100,₹50,3.5,11,4,30 minutes,100,50
2,ID_1595,Mumbai Central,"Italian, Street Food, Fast Food",₹150,₹50,3.6,99,30,65 minutes,150,50
3,ID_5929,"Sector 1, Noida","Mughlai, North Indian, Chinese",₹250,₹99,3.7,176,95,30 minutes,250,99
4,ID_6123,"Rmz Centennial, I Gate, Whitefield","Cafe, Beverages",₹200,₹99,3.2,521,235,65 minutes,200,99

In [202]:
df['Rating_Cleaned'] = replace_nn_with(df['Rating'],float, method = 'mean')

------------------------------
------------------------------
Non Numerals in column  Rating  :  ['-', 'NEW', 'Opening Soon', 'Temporarily Closed']
Filling Non Numerals with MEAN =  3.6134596429744668
1963 : observations replaced

In [203]:
df['Votes_Cleaned'] = replace_nn_with(df['Votes'],int,method =  'mean')

------------------------------
------------------------------
Non Numerals in column  Votes  :  ['-']
Filling Non Numerals with MEAN =  244.54445676274943
2074 : observations replaced

In [204]:
df['Reviews_Cleaned'] = replace_nn_with(df['Reviews'],int, method =  'mean')

------------------------------
------------------------------
Non Numerals in column  Reviews  :  ['-']
Filling Non Numerals with MEAN =  123.24789341835573
2312 : observations replaced

In [205]:
df['Delivery_Time_Cleaned'] = df['Delivery_Time'].apply(lambda x: int(re.sub("[^0-9]", "", x)))

In [37]:
df.head(5)

,Restaurant,Location,Cuisines,Average_Cost,Minimum_Order,Rating,Votes,Reviews,Delivery_Time,Average_Cost_Cleaned,Minimum_Order_Cleaned,Rating_Cleaned,Votes_Cleaned,Reviews_Cleaned
0,ID_6321,"FTI College, Law College Road, Pune","Fast Food, Rolls, Burger, Salad, Wraps",₹200,₹50,3.5,12,4,30 minutes,200,50,3.5,12,4
1,ID_2882,"Sector 3, Marathalli","Ice Cream, Desserts",₹100,₹50,3.5,11,4,30 minutes,100,50,3.5,11,4
2,ID_1595,Mumbai Central,"Italian, Street Food, Fast Food",₹150,₹50,3.6,99,30,65 minutes,150,50,3.6,99,30
3,ID_5929,"Sector 1, Noida","Mughlai, North Indian, Chinese",₹250,₹99,3.7,176,95,30 minutes,250,99,3.7,176,95
4,ID_6123,"Rmz Centennial, I Gate, Whitefield","Cafe, Beverages",₹200,₹99,3.2,521,235,65 minutes,200,99,3.2,521,235

In [188]:
df.columns

Index(['Restaurant', 'Location', 'Cuisines', 'Average_Cost', 'Minimum_Order',
       'Rating', 'Votes', 'Reviews', 'Delivery_Time', 'Average_Cost_Cleaned',
       'Minimum_Order_Cleaned', 'Rating_Cleaned', 'Votes_Cleaned',
       'Reviews_Cleaned', 'Delivery_Time_Cleaned'],
      dtype='object')

In [206]:
cols = ['Location',  'Average_Cost_Cleaned',
       'Minimum_Order_Cleaned', 'Rating_Cleaned', 'Votes_Cleaned',
       'Reviews_Cleaned','Delivery_Time_Cleaned' ]

In [207]:
train_sample = df[cols]

In [113]:
train_sample.head(5)

,Location,Average_Cost_Cleaned,Minimum_Order_Cleaned,Rating_Cleaned,Votes_Cleaned,Reviews_Cleaned,Delivery_Time_Cleaned
0,"FTI College, Law College Road, Pune",200,50,3.5,12,4,30
1,"Sector 3, Marathalli",100,50,3.5,11,4,30
2,Mumbai Central,150,50,3.6,99,30,65
3,"Sector 1, Noida",250,99,3.7,176,95,30
4,"Rmz Centennial, I Gate, Whitefield",200,99,3.2,521,235,65

In [169]:
train_sample2=train_sample

In [86]:
train_sample.isnull().sum()

Location                 0
Average_Cost_Cleaned     0
Minimum_Order_Cleaned    0
Rating_Cleaned           0
Votes_Cleaned            0
Reviews_Cleaned          0
Delivery_Time_Cleaned    0
dtype: int64

In [69]:
train_sample.Location

0        FTI College, Law College Road, Pune
1                       Sector 3, Marathalli
2                             Mumbai Central
3                            Sector 1, Noida
4         Rmz Centennial, I Gate, Whitefield
                        ...
11089          BTM Layout 1, Electronic City
11090                       Sector 14, Noida
11091                               Majestic
11092                   Sector 3, Marathalli
11093                     Sector 63A,Gurgaon
Name: Location, Length: 11094, dtype: object

In [66]:
train_sample.to_csv('train11.csv')

In [71]:
from sklearn.preprocessing import LabelEncoder
classle = LabelEncoder()

train_sample['Location_code'] = classle.fit_transform(train_sample['Location'].values)

C:\Users\JIMFLO~1\AppData\Local\Temp/ipykernel_2584/1540524085.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_sample['Location_code'] = classle.fit_transform(train_sample['Location'].values)
C:\Users\JIMFLO~1\AppData\Local\Temp/ipykernel_2584/1540524085.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_sample['Cuisines_code'] = classle.fit_transform(train_sample['Cuisines'].values)

In [60]:
train_sample['Location_code'].value_counts()

17    947
4     806
28    791
10    584
8     545
14    493
29    489
5     472
19    459
26    457
7     411
15    402
21    372
27    370
30    366
16    334
6     326
34    307
9     291
1     282
24    278
31    260
18    137
2     126
32    109
25    108
33     96
12     81
11     79
22     68
20     68
23     56
3      54
13     48
0      22
Name: Location_code, dtype: int64

In [87]:
train_sample.to_csv('train12.csv')

In [208]:
import numpy as np

def get_outlier(df=None, column=None, weight=1.5):
  # target 값과 상관관계가 높은 열을 우선적으로 진행
  quantile_25 = np.percentile(df[column].values, 25)
  quantile_75 = np.percentile(df[column].values, 75)

  IQR = quantile_75 - quantile_25
  IQR_weight = IQR*weight
  
  lowest = quantile_25 - IQR_weight
  highest = quantile_75 + IQR_weight
  
  outlier_idx = df[column][ (df[column] < lowest) | (df[column] > highest) ].index
  return outlier_idx

In [209]:
import numpy as np

def get_outlier2(df=None, column=None, weight=1.5):
  # target 값과 상관관계가 높은 열을 우선적으로 진행
  quantile_1 = np.percentile(df[column].values, 1)
  quantile_96 = np.percentile(df[column].values, 96)

  
  lowest = quantile_1 
  highest = quantile_96
  
  outlier_idx = df[column][ (df[column] < lowest) | (df[column] > highest) ].index
  return outlier_idx

In [211]:
# 함수 사용해서 이상치 값 삭제
outlier_idx = get_outlier(df=train_sample, column='Average_Cost_Cleaned', weight=1.5)
train_sample.drop(outlier_idx, axis=0, inplace=True)

C:\Users\jimflower\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [213]:
outlier_idx2 = get_outlier2(df=train_sample, column='Minimum_Order_Cleaned', weight=1.5)
train_sample.drop(outlier_idx2, axis=0, inplace=True)

In [215]:
outlier_idx = get_outlier(df=train_sample, column='Rating_Cleaned', weight=1.5)
train_sample.drop(outlier_idx, axis=0, inplace=True)

In [217]:
outlier_idx = get_outlier(df=train_sample, column='Votes_Cleaned', weight=1.5)
train_sample.drop(outlier_idx, axis=0, inplace=True)

In [219]:
outlier_idx = get_outlier(df=train_sample, column='Reviews_Cleaned', weight=1.5)
train_sample.drop(outlier_idx, axis=0, inplace=True)

In [221]:
outlier_idx = get_outlier(df=train_sample, column='Delivery_Time_Cleaned', weight=1.5)
train_sample.drop(outlier_idx, axis=0, inplace=True)

In [222]:
train_sample.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9357 entries, 0 to 11093
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Location               9357 non-null   object
 1   Average_Cost_Cleaned   9357 non-null   int64
 2   Minimum_Order_Cleaned  9357 non-null   int64
 3   Rating_Cleaned         9357 non-null   float64
 4   Votes_Cleaned          9357 non-null   int32
 5   Reviews_Cleaned        9357 non-null   int32
 6   Delivery_Time_Cleaned  9357 non-null   int64
dtypes: float64(1), int32(2), int64(3), object(1)
memory usage: 511.7+ KB

In [223]:
train_sample.to_csv('train13.csv')